#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийПользователь; 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписокСотрудников из СписокСотрудников Цикл
		ДвижениеДопНачисления = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвижениеДопНачисления.Сторно = Ложь;
		ДвижениеДопНачисления.ПериодРегистрации = Дата;
		ДвижениеДопНачисления.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФексированаяПремия;
		ДвижениеДопНачисления.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		ДвижениеДопНачисления.Сумма = ТекСтрокаСписокСотрудников.СуммаПремии;
		
		ДвижениеУдержание = Движения.ВКМ_Удержания.Добавить();
		ДвижениеУдержание.Сторно = Ложь;
		ДвижениеУдержание.ПериодРегистрации = Дата;
		ДвижениеУдержание.ПериодДействияКонец =НачалоМесяца(Дата);
		ДвижениеУдержание.ПериодДействияКонец = КонецГода(Дата);
		ДвижениеУдержание.БазовыйПериодНачало = НачалоМесяца(Дата);
		ДвижениеУдержание.БазовыйПериодКонец = КонецМесяца(Дата);
		ДвижениеУдержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.УдержаниеНДФЛ;
		ДвижениеУдержание.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		ДвижениеУдержание.Сумма = ТекСтрокаСписокСотрудников.СуммаПремии * 13/100;
		
	    Движение= Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
	    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Сумма = ТекСтрокаСписокСотрудников.СуммаПремии  - ДвижениеУдержание.Сумма;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#КонецЕсли