
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийПользователь; 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаВыплаты из Выплаты Цикл
		Если ЗначениеЗаполнено(ТекСтрокаВыплаты.Сумма) И ЗначениеЗаполнено(ТекСтрокаВыплаты.Сотрудник) Тогда
		     Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		     Движение.Период = Дата;
		     Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		     Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
		     Движение.Сумма = ТекСтрокаВыплаты.Сумма;
		 КонецЕсли;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти	

#КонецЕсли