
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных	
	
перем ЗнчРеквизитовОбъектаВБазе;
	
#КонецОбласти

#Область ОбработчикиСобытий	

Процедура ОбработкаПроведения(Отказ,Режим)
	
	ДоговорКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"Договор" );
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента,"ВидДоговора" );
	
	Если ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Необходим вид дговора на обслуживание!!!");
		Возврат;
		
	КонецЕсли;
	
	ДанныеДоговораОбслуживания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента,"ВидДоговора,ВКМ_ДатаНачалаДоговора,ВКМ_ДатаОкончанияДоговора,ВКМ_СтоимостьЧасаРаботы" );
	
	
	
	
	ДатаНачала = ДанныеДоговораОбслуживания.ВКМ_ДатаНачалаДоговора;
	ДатаОкончания = ДанныеДоговораОбслуживания.ВКМ_ДатаОкончанияДоговора;
	СтоимостьЧасаРаботы = ДанныеДоговораОбслуживания.ВКМ_СтоимостьЧасаРаботы;
	
	Если НЕ (Дата >= ДатаНачала И Дата <= ДатаОкончания) Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Закончился договор обслуживания");
	
		Возврат;
		
	КонецЕсли;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = ВыполненыеРаботы.Итог("ЧасыКОплатеКлиенту");
	Движение.СуммаКОплате = Движение.КоличествоЧасов * СтоимостьЧасаРаботы;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
   
    
	Если ОбменДанными.Загрузка Или ЭтоНовый() Тогда
	   Возврат;
	КонецЕсли;
	
	ЗнчРеквизитовОбъектаВБазе = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"Клиент,Специалист,ДатаПроведенияРабот,ВремяНачалоРабот,ВремяОкончанияРабот" );
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НужноУведомление = Ложь;
	
	Если   ЗнчРеквизитовОбъектаВБазе = Неопределено   Тогда
		НужноУведомление = Истина;
		ТекстУведомления = СтрШаблон("Новая  задача от %1 .Выполнить: %2. Дата и время выполнения: %3 с %4 до %5.Исполнитель : %6",
		                             Клиент,ОписаниеПроблемы,ДатаПроведенияРабот,
		                             ВремяНачалоРабот,ВремяОкончанияРабот,Специалист);
	Иначе
		ТекстУведомления = СтрШаблон("Изменения в задаче от %1. Выполнить: %2.", Клиент,ОписаниеПроблемы);
		
		Если ДатаПроведенияРабот <> ЗнчРеквизитовОбъектаВБазе.ДатаПроведенияРабот Тогда
			НужноУведомление = Истина;
			ТекстУведомления = ТекстУведомления + СтрШаблон(" Дата %1.",Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy;" ));
		КонецЕсли;
		
	    Если ВремяНачалоРабот <> ЗнчРеквизитовОбъектаВБазе.ВремяНачалоРабот Тогда
			НужноУведомление = Истина;
			ТекстУведомления = ТекстУведомления + СтрШаблон(" Время начало работы в %1.",Формат(ВремяНачалоРабот,"ДЛФ=T;" ));
	    КонецЕсли;
	        
	    Если ВремяОкончанияРабот <> ЗнчРеквизитовОбъектаВБазе.ВремяОкончанияРабот Тогда
			НужноУведомление = Истина;
			ТекстУведомления = ТекстУведомления + СтрШаблон(" Время окончания работы до %1.",Формат(ВремяОкончанияРабот,"ДЛФ=T;" ));
		КонецЕсли;
       
        Если Специалист <> ЗнчРеквизитовОбъектаВБазе.Специалист Тогда
        	НужноУведомление = Истина;
			ТекстУведомления = ТекстУведомления + СтрШаблон(" Заменен исполнитель на %1", Специалист );
		КонецЕсли;	
        	
	КонецЕсли;
	
	Если НужноУведомление Тогда
	     НовоеУведомление = Справочники.ВКМ_УведомленияТелеграммБоту.СоздатьЭлемент();
	     НовоеУведомление.ТекстСообщения = ТекстУведомления;
	     НовоеУведомление.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
