#Область ПрограммныйИнтерфейс 

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
Процедура ДополнитьФормы(Форма)  Экспорт
	
	//Какую Форму дополняем
	Если Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда
		ДобавитьПоляНаФорму(Форма);
	КонецЕсли;	
	
	Если Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКомандуНаФорму (Форма);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПоляНаФорму(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("Номер",Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Код"; 
	
	ПолеВвода = Форма.Элементы.Добавить("Наименование",Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Наименование"; 
	
	ПолеВвода = Форма.Элементы.Добавить("Контрагент",Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Владелец"; 
	
	ПолеВвода = Форма.Элементы.Добавить("Организация",Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Организация"; 
	
	ПолеВвода = Форма.Элементы.Добавить("ВидДоговора",Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВидДоговора"; 
	
	ГруппаФормы = Форма.Элементы.Добавить("ДляДоговораАбонента",Тип("ГруппаФормы"));
	ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;		
	ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ГруппаФормы = Форма.Элементы.Добавить("ПериодОбслуживания",Тип("ГруппаФормы"),Форма.Элементы.ДляДоговораАбонента);
	ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;		
	ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеВвода = Форма.Элементы.Добавить("С",Тип("ПолеФормы"),Форма.Элементы.ПериодОбслуживания);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДоговора"; 
	
	ПолеВвода = Форма.Элементы.Добавить("По",Тип("ПолеФормы"),Форма.Элементы.ПериодОбслуживания);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДоговора"; 
	
	ПолеВвода = Форма.Элементы.Добавить("СуммаАбоненскойПлаты",Тип("ПолеФормы"),Форма.Элементы.ДляДоговораАбонента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммуАбонентскойПлаты"; 
	
	ПолеВвода = Форма.Элементы.Добавить("СтоимостьЧасаРаботы",Тип("ПолеФормы"),Форма.Элементы.ДляДоговораАбонента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
	ДобавитьОбрабочикИзмененияТипаДоговора(Форма);
КонецПроцедуры

Процедура ДобавитьОбрабочикИзмененияТипаДоговора(Форма)
	
	Форма.Элементы.ВидДоговора.УстановитьДействие("ПриИзменении","ВидДоговораПриИзменении");
	
КонецПроцедуры

Процедура ДобавитьКомандуНаФорму (Форма)
	
    //Создаем команду для форме
    Команда = Форма.Команды.Добавить("Заполнить");
	Команда.Заголовок = "Заполнить";
	Команда.Действие = "ВКМ_ПроверкаДоговораИВызовАвтозаполнения";
	
	// Выносим команду на форму в виде кнопки обычной
	КнопкаФормы = Форма.Элементы.Добавить("Заполнить",Тип("КнопкаФормы"),Форма.Элементы.ФормаКоманднаяПанель); 
	КнопкаФормы.ИмяКоманды = "Заполнить";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
  
	
КонецПроцедуры
  #КонецОбласти