#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция ЗаполнениеТаблицы(Период) Экспорт
	//1)Находим все договоры обслуживания на месяц  указаным бухгалтером в периоде.
	//2)Отбираем те договора каторые имеют абоненскую плату и по каторым не создана реализация.
	//3)вызываем автозаполнение дока рту передаем параметром договор.

    ДоговорыДляРТУ = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК СсылкаДоговор,
		|	РеализацияТоваровУслуг.Ссылка КАК СсылкаРТУ,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора КАК ДатаОкончанияДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И (ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора <= &ПериодОкончания
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора >= &ПериодНачало)";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("ПериодНачало", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодОкончания", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СсылкаРТУ = Выборка.СсылкаРТУ;
		Если Не ЗначениеЗаполнено(Выборка.СсылкаРТУ) Тогда
			
			ДанныеЗаполнения = Новый Структура();
			ДанныеЗаполнения.Вставить("Дата",Формат(Выборка.ДатаОкончанияДоговора,"ДЛФ=DT;"));
			ДанныеЗаполнения.Вставить("Договор",Выборка.СсылкаДоговор);
			ДанныеЗаполнения.Вставить("Организация",Выборка.Организация);
			ДанныеЗаполнения.Вставить("Контрагент",Выборка.Контрагент);
			
			НовыйДокументРту = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокументРту.Заполнить(ДанныеЗаполнения);
		    НовыйДокументРту.ВКМ_ВыполнитьАвтозаполнение(Выборка.СсылкаДоговор);
		    Если НовыйДокументРту.ПроверитьЗаполнение() Тогда
		        НовыйДокументРту.Записать(РежимЗаписиДокумента.Запись);
		    КонецЕсли;
		    СсылкаРту = НовыйДокументРту.Ссылка;
		КонецЕсли;
		  ДоговорыДляРТУ.Вставить(Выборка.СсылкаДоговор,СсылкаРту );
	
	КонецЦикла;
	
  Возврат ДоговорыДляРТУ;
	
КонецФункции
#КонецОбласти

#КонецЕсли