#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()
		
	Курсор = Период.ДатаНачала;
	
	Пока Курсор < Период.ДатаОкончания   Цикл 
		
		Запись = РегистрыСведений.ВКМ_ГрафикРабочихДней.СоздатьМенеджерЗаписи();
		Запись.Дата  = Курсор; 
		
		Если ДеньНедели(Курсор)<= 5 тогда
			Запись.РабочийДень = 1;
		Иначе
			Запись.РабочийДень = 0;
		КонецЕсли;
		Запись.Записать();
		Курсор = Курсор + 86400;
		
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
