#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
     ВКМ_РаботаСФормами.ДополнитьФормы(ЭтотОбъект);
     
     Если Параметры.Ключ.Пустая() Или Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
     	Элементы.ДляДоговораАбонента.Видимость = Ложь;   
     КонецЕсли;
     
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//@skip-check module-structure-form-event-regions
//@skip-check module-unused-method
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание")  Тогда
		
		Элементы.ДляДоговораАбонента.Видимость = Истина; 
		
	Иначе
		
		Элементы.ДляДоговораАбонента.Видимость = Ложь;    
		 
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

