#Область СлужебныеПроцедурыИФункции

Функция ОтправкаСообщенияВГруппу(Текст,Константа) Экспорт
	
	Токен = Константа.Токен ;
	ИдГруппы = Константа.ИдГруппы ;
    
    URL ="api.telegram.org";
    Соединение = Новый HTTPСоединение(URL,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
    
    Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type","application/json");
	
	АдресЗапроса = СтрШаблон("bot%1/sendMessage?chat_id=%2",Токен,Формат(ИдГруппы,"ЧГ="));
	
	Запрос = Новый HTTPЗапрос(АдресЗапроса,Заголовки);
	Данные = Новый Структура;
	Данные.Вставить("text",Текст);
	
	Запрос.УстановитьТелоИзСтроки(ОбщегоНазначения.ЗначениеВJSON(Данные),КодировкаТекста.UTF8);
	
	Попытка
		//@skip-check bsl-legacy-check-dynamic-feature-access
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru='Выполнение операции'" ),
		УровеньЖурналаРегистрации.Ошибка , , ,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если Ответ.КодСостояния <> 200 Тогда
		ДеталиОшибки = Строка(Ответ.КодСостояния) + Символы.ПС + Ответ.ПолучитьТелоКакСтроку();
		ВызватьИсключение ДеталиОшибки;
	КонецЕсли;
	
	Возврат Ответ.КодСостояния;
	
КонецФункции

#КонецОбласти